Revit 2024 API
Space.ActualPowerLoad Property
Get the Actual Power Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double ActualPowerLoad { get; }
Visual Basic
Public ReadOnly Property ActualPowerLoad As Double
	Get
Visual C++
public:
property double ActualPowerLoad {
	double get ();
}
Remarks
This property is used to get the Actual Power Load of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace